Функция ПолучитьЦенуНоменклатуры(Номенклатура) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетЦенНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.УчетЦенНоменклатуры.СрезПоследних(, Номенклатура = &Номенклатура) КАК УчетЦенНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда	
		Возврат 0;	
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Цена;
КонецФункции // ПолучитьЦенуНоменклатуры
